// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

void F
int [] array = {0, 1, 2, 3, 4, 5, 6, 7};
int number = new Random().Next(0, 8);

System.Console.WriteLine(array);